synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/pevc.h
/**
 * \file
 *
 * \brief Component description for PEVC
 *
 * Copyright (c) 2014 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_PEVC_COMPONENT_
#define _SAM4L_PEVC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PEVC */
/* ========================================================================== */
/** \addtogroup SAM4L_PEVC Peripheral Event Controller */
/*@{*/

#define PEVC_I7533
#define REV_PEVC                    0x200

/* -------- PEVC_CHSR : (PEVC Offset: 0x000) (R/  32) Channel Status Register -------- */
#define PEVC_CHSR_OFFSET            0x000        /**< \brief (PEVC_CHSR offset) Channel Status Register */
#define PEVC_CHSR_RESETVALUE        0x00000000   /**< \brief (PEVC_CHSR reset_value) Channel Status Register */

#define PEVC_CHSR_CHS_Pos           0            /**< \brief (PEVC_CHSR) Channel Status */
#define PEVC_CHSR_CHS_Msk           (0xFFFFFFFFu << PEVC_CHSR_CHS_Pos)
#define PEVC_CHSR_CHS(value)        ((PEVC_CHSR_CHS_Msk & ((value) << PEVC_CHSR_CHS_Pos)))
#define   PEVC_CHSR_CHS_0_Val             0x0u   /**< \brief (PEVC_CHSR) Channel j Disabled */
#define   PEVC_CHSR_CHS_1_Val             0x1u   /**< \brief (PEVC_CHSR) Channel j Enabled */
#define PEVC_CHSR_CHS_0             (PEVC_CHSR_CHS_0_Val           << PEVC_CHSR_CHS_Pos)
#define PEVC_CHSR_CHS_1             (PEVC_CHSR_CHS_1_Val           << PEVC_CHSR_CHS_Pos)
#define PEVC_CHSR_MASK              0xFFFFFFFFu  /**< \brief (PEVC_CHSR) MASK Register */

/* -------- PEVC_CHER : (PEVC Offset: 0x004) ( /W 32) Channel Enable Register -------- */
#define PEVC_CHER_OFFSET            0x004        /**< \brief (PEVC_CHER offset) Channel Enable Register */
#define PEVC_CHER_RESETVALUE        0x00000000   /**< \brief (PEVC_CHER reset_value) Channel Enable Register */

#define PEVC_CHER_CHE_Pos           0            /**< \brief (PEVC_CHER) Channel Enable */
#define PEVC_CHER_CHE_Msk           (0xFFFFFFFFu << PEVC_CHER_CHE_Pos)
#define PEVC_CHER_CHE(value)        ((PEVC_CHER_CHE_Msk & ((value) << PEVC_CHER_CHE_Pos)))
#define   PEVC_CHER_CHE_0_Val             0x0u   /**< \brief (PEVC_CHER) No Action */
#define   PEVC_CHER_CHE_1_Val             0x1u   /**< \brief (PEVC_CHER) Enable Channel j */
#define PEVC_CHER_CHE_0             (PEVC_CHER_CHE_0_Val           << PEVC_CHER_CHE_Pos)
#define PEVC_CHER_CHE_1             (PEVC_CHER_CHE_1_Val           << PEVC_CHER_CHE_Pos)
#define PEVC_CHER_MASK              0xFFFFFFFFu  /**< \brief (PEVC_CHER) MASK Register */

/* -------- PEVC_CHDR : (PEVC Offset: 0x008) ( /W 32) Channel Disable Register -------- */
#define PEVC_CHDR_OFFSET            0x008        /**< \brief (PEVC_CHDR offset) Channel Disable Register */
#define PEVC_CHDR_RESETVALUE        0x00000000   /**< \brief (PEVC_CHDR reset_value) Channel Disable Register */

#define PEVC_CHDR_CHD_Pos           0            /**< \brief (PEVC_CHDR) Channel Disable */
#define PEVC_CHDR_CHD_Msk           (0xFFFFFFFFu << PEVC_CHDR_CHD_Pos)
#define PEVC_CHDR_CHD(value)        ((PEVC_CHDR_CHD_Msk & ((value) << PEVC_CHDR_CHD_Pos)))
#define   PEVC_CHDR_CHD_0_Val             0x0u   /**< \brief (PEVC_CHDR) No Action */
#define   PEVC_CHDR_CHD_1_Val             0x1u   /**< \brief (PEVC_CHDR) Disable Channel j */
#define PEVC_CHDR_CHD_0             (PEVC_CHDR_CHD_0_Val           << PEVC_CHDR_CHD_Pos)
#define PEVC_CHDR_CHD_1             (PEVC_CHDR_CHD_1_Val           << PEVC_CHDR_CHD_Pos)
#define PEVC_CHDR_MASK              0xFFFFFFFFu  /**< \brief (PEVC_CHDR) MASK Register */

/* -------- PEVC_SEV : (PEVC Offset: 0x010) ( /W 32) Software Event -------- */
#define PEVC_SEV_OFFSET             0x010        /**< \brief (PEVC_SEV offset) Software Event */
#define PEVC_SEV_RESETVALUE         0x00000000   /**< \brief (PEVC_SEV reset_value) Software Event */

#define PEVC_SEV_SEV_Pos            0            /**< \brief (PEVC_SEV) Software Event */
#define PEVC_SEV_SEV_Msk            (0xFFFFFFFFu << PEVC_SEV_SEV_Pos)
#define PEVC_SEV_SEV(value)         ((PEVC_SEV_SEV_Msk & ((value) << PEVC_SEV_SEV_Pos)))
#define   PEVC_SEV_SEV_0_Val              0x0u   /**< \brief (PEVC_SEV) No Action */
#define   PEVC_SEV_SEV_1_Val              0x1u   /**< \brief (PEVC_SEV) CPU forces software event to channel j */
#define PEVC_SEV_SEV_0              (PEVC_SEV_SEV_0_Val            << PEVC_SEV_SEV_Pos)
#define PEVC_SEV_SEV_1              (PEVC_SEV_SEV_1_Val            << PEVC_SEV_SEV_Pos)
#define PEVC_SEV_MASK               0xFFFFFFFFu  /**< \brief (PEVC_SEV) MASK Register */

/* -------- PEVC_BUSY : (PEVC Offset: 0x014) (R/  32) Channel / User Busy -------- */
#define PEVC_BUSY_OFFSET            0x014        /**< \brief (PEVC_BUSY offset) Channel / User Busy */
#define PEVC_BUSY_RESETVALUE        0x00000000   /**< \brief (PEVC_BUSY reset_value) Channel / User Busy */

