synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/pevc.h
#define PEVC_BUSY_BUSY_Pos          0            /**< \brief (PEVC_BUSY) Channel Status */
#define PEVC_BUSY_BUSY_Msk          (0xFFFFFFFFu << PEVC_BUSY_BUSY_Pos)
#define PEVC_BUSY_BUSY(value)       ((PEVC_BUSY_BUSY_Msk & ((value) << PEVC_BUSY_BUSY_Pos)))
#define   PEVC_BUSY_BUSY_0_Val            0x0u   /**< \brief (PEVC_BUSY) No Action */
#define   PEVC_BUSY_BUSY_1_Val            0x1u   /**< \brief (PEVC_BUSY) Channel j or User j is Busy */
#define PEVC_BUSY_BUSY_0            (PEVC_BUSY_BUSY_0_Val          << PEVC_BUSY_BUSY_Pos)
#define PEVC_BUSY_BUSY_1            (PEVC_BUSY_BUSY_1_Val          << PEVC_BUSY_BUSY_Pos)
#define PEVC_BUSY_MASK              0xFFFFFFFFu  /**< \brief (PEVC_BUSY) MASK Register */

/* -------- PEVC_TRIER : (PEVC Offset: 0x020) ( /W 32) Trigger Interrupt Mask Enable Register -------- */
#define PEVC_TRIER_OFFSET           0x020        /**< \brief (PEVC_TRIER offset) Trigger Interrupt Mask Enable Register */
#define PEVC_TRIER_RESETVALUE       0x00000000   /**< \brief (PEVC_TRIER reset_value) Trigger Interrupt Mask Enable Register */

#define PEVC_TRIER_TRIE_Pos         0            /**< \brief (PEVC_TRIER) Trigger Interrupt Enable */
#define PEVC_TRIER_TRIE_Msk         (0xFFFFFFFFu << PEVC_TRIER_TRIE_Pos)
#define PEVC_TRIER_TRIE(value)      ((PEVC_TRIER_TRIE_Msk & ((value) << PEVC_TRIER_TRIE_Pos)))
#define   PEVC_TRIER_TRIE_0_Val           0x0u   /**< \brief (PEVC_TRIER) No Action */
#define   PEVC_TRIER_TRIE_1_Val           0x1u   /**< \brief (PEVC_TRIER) Enable Trigger j Interrupt */
#define PEVC_TRIER_TRIE_0           (PEVC_TRIER_TRIE_0_Val         << PEVC_TRIER_TRIE_Pos)
#define PEVC_TRIER_TRIE_1           (PEVC_TRIER_TRIE_1_Val         << PEVC_TRIER_TRIE_Pos)
#define PEVC_TRIER_MASK             0xFFFFFFFFu  /**< \brief (PEVC_TRIER) MASK Register */

/* -------- PEVC_TRIDR : (PEVC Offset: 0x024) ( /W 32) Trigger Interrupt Mask Disable Register -------- */
#define PEVC_TRIDR_OFFSET           0x024        /**< \brief (PEVC_TRIDR offset) Trigger Interrupt Mask Disable Register */
#define PEVC_TRIDR_RESETVALUE       0x00000000   /**< \brief (PEVC_TRIDR reset_value) Trigger Interrupt Mask Disable Register */

#define PEVC_TRIDR_TRID_Pos         0            /**< \brief (PEVC_TRIDR) Trigger Interrupt Disable */
#define PEVC_TRIDR_TRID_Msk         (0xFFFFFFFFu << PEVC_TRIDR_TRID_Pos)
#define PEVC_TRIDR_TRID(value)      ((PEVC_TRIDR_TRID_Msk & ((value) << PEVC_TRIDR_TRID_Pos)))
#define   PEVC_TRIDR_TRID_0_Val           0x0u   /**< \brief (PEVC_TRIDR) No Action */
#define   PEVC_TRIDR_TRID_1_Val           0x1u   /**< \brief (PEVC_TRIDR) Disable Trigger j Interrupt */
#define PEVC_TRIDR_TRID_0           (PEVC_TRIDR_TRID_0_Val         << PEVC_TRIDR_TRID_Pos)
#define PEVC_TRIDR_TRID_1           (PEVC_TRIDR_TRID_1_Val         << PEVC_TRIDR_TRID_Pos)
#define PEVC_TRIDR_MASK             0xFFFFFFFFu  /**< \brief (PEVC_TRIDR) MASK Register */

/* -------- PEVC_TRIMR : (PEVC Offset: 0x028) (R/  32) Trigger Interrupt Mask Register -------- */
#define PEVC_TRIMR_OFFSET           0x028        /**< \brief (PEVC_TRIMR offset) Trigger Interrupt Mask Register */
#define PEVC_TRIMR_RESETVALUE       0x00000000   /**< \brief (PEVC_TRIMR reset_value) Trigger Interrupt Mask Register */

#define PEVC_TRIMR_TRIM_Pos         0            /**< \brief (PEVC_TRIMR) Trigger Interrupt Mask */
#define PEVC_TRIMR_TRIM_Msk         (0xFFFFFFFFu << PEVC_TRIMR_TRIM_Pos)
#define PEVC_TRIMR_TRIM(value)      ((PEVC_TRIMR_TRIM_Msk & ((value) << PEVC_TRIMR_TRIM_Pos)))
#define   PEVC_TRIMR_TRIM_0_Val           0x0u   /**< \brief (PEVC_TRIMR) Trigger j Interrupt Disabled */
#define   PEVC_TRIMR_TRIM_1_Val           0x1u   /**< \brief (PEVC_TRIMR) Trigger j Interrupt Enabled */
#define PEVC_TRIMR_TRIM_0           (PEVC_TRIMR_TRIM_0_Val         << PEVC_TRIMR_TRIM_Pos)
#define PEVC_TRIMR_TRIM_1           (PEVC_TRIMR_TRIM_1_Val         << PEVC_TRIMR_TRIM_Pos)
#define PEVC_TRIMR_MASK             0xFFFFFFFFu  /**< \brief (PEVC_TRIMR) MASK Register */

/* -------- PEVC_TRSR : (PEVC Offset: 0x030) (R/  32) Trigger Status Register -------- */
#define PEVC_TRSR_OFFSET            0x030        /**< \brief (PEVC_TRSR offset) Trigger Status Register */
#define PEVC_TRSR_RESETVALUE        0x00000000   /**< \brief (PEVC_TRSR reset_value) Trigger Status Register */

#define PEVC_TRSR_TRS_Pos           0            /**< \brief (PEVC_TRSR) Trigger Interrupt Status */
#define PEVC_TRSR_TRS_Msk           (0xFFFFFFFFu << PEVC_TRSR_TRS_Pos)
#define PEVC_TRSR_TRS(value)        ((PEVC_TRSR_TRS_Msk & ((value) << PEVC_TRSR_TRS_Pos)))
#define   PEVC_TRSR_TRS_0_Val             0x0u   /**< \brief (PEVC_TRSR) Channel j did not send out an Event in the past */
#define   PEVC_TRSR_TRS_1_Val             0x1u   /**< \brief (PEVC_TRSR) Channel j did send out an Event in the past */
#define PEVC_TRSR_TRS_0             (PEVC_TRSR_TRS_0_Val           << PEVC_TRSR_TRS_Pos)
#define PEVC_TRSR_TRS_1             (PEVC_TRSR_TRS_1_Val           << PEVC_TRSR_TRS_Pos)
#define PEVC_TRSR_MASK              0xFFFFFFFFu  /**< \brief (PEVC_TRSR) MASK Register */

/* -------- PEVC_TRSCR : (PEVC Offset: 0x034) ( /W 32) Trigger Status Clear Register -------- */
#define PEVC_TRSCR_OFFSET           0x034        /**< \brief (PEVC_TRSCR offset) Trigger Status Clear Register */
#define PEVC_TRSCR_RESETVALUE       0x00000000   /**< \brief (PEVC_TRSCR reset_value) Trigger Status Clear Register */

#define PEVC_TRSCR_TRSC_Pos         0            /**< \brief (PEVC_TRSCR) Trigger Interrupt Status Clear */
#define PEVC_TRSCR_TRSC_Msk         (0xFFFFFFFFu << PEVC_TRSCR_TRSC_Pos)
#define PEVC_TRSCR_TRSC(value)      ((PEVC_TRSCR_TRSC_Msk & ((value) << PEVC_TRSCR_TRSC_Pos)))
#define   PEVC_TRSCR_TRSC_0_Val           0x0u   /**< \brief (PEVC_TRSCR) No Action */
#define   PEVC_TRSCR_TRSC_1_Val           0x1u   /**< \brief (PEVC_TRSCR) Clear TRSR[j] */
#define PEVC_TRSCR_TRSC_0           (PEVC_TRSCR_TRSC_0_Val         << PEVC_TRSCR_TRSC_Pos)
#define PEVC_TRSCR_TRSC_1           (PEVC_TRSCR_TRSC_1_Val         << PEVC_TRSCR_TRSC_Pos)
#define PEVC_TRSCR_MASK             0xFFFFFFFFu  /**< \brief (PEVC_TRSCR) MASK Register */

