synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/pevc.h
/* -------- PEVC_OVIER : (PEVC Offset: 0x040) ( /W 32) Overrun Interrupt Mask Enable Register -------- */
#define PEVC_OVIER_OFFSET           0x040        /**< \brief (PEVC_OVIER offset) Overrun Interrupt Mask Enable Register */
#define PEVC_OVIER_RESETVALUE       0x00000000   /**< \brief (PEVC_OVIER reset_value) Overrun Interrupt Mask Enable Register */

#define PEVC_OVIER_OVIE_Pos         0            /**< \brief (PEVC_OVIER) Overrun Interrupt Enable */
#define PEVC_OVIER_OVIE_Msk         (0xFFFFFFFFu << PEVC_OVIER_OVIE_Pos)
#define PEVC_OVIER_OVIE(value)      ((PEVC_OVIER_OVIE_Msk & ((value) << PEVC_OVIER_OVIE_Pos)))
#define   PEVC_OVIER_OVIE_0_Val           0x0u   /**< \brief (PEVC_OVIER) No Action */
#define   PEVC_OVIER_OVIE_1_Val           0x1u   /**< \brief (PEVC_OVIER) Enable Overrun Interrupt for Channel j */
#define PEVC_OVIER_OVIE_0           (PEVC_OVIER_OVIE_0_Val         << PEVC_OVIER_OVIE_Pos)
#define PEVC_OVIER_OVIE_1           (PEVC_OVIER_OVIE_1_Val         << PEVC_OVIER_OVIE_Pos)
#define PEVC_OVIER_MASK             0xFFFFFFFFu  /**< \brief (PEVC_OVIER) MASK Register */

/* -------- PEVC_OVIDR : (PEVC Offset: 0x044) ( /W 32) Overrun Interrupt Mask Disable Register -------- */
#define PEVC_OVIDR_OFFSET           0x044        /**< \brief (PEVC_OVIDR offset) Overrun Interrupt Mask Disable Register */
#define PEVC_OVIDR_RESETVALUE       0x00000000   /**< \brief (PEVC_OVIDR reset_value) Overrun Interrupt Mask Disable Register */

#define PEVC_OVIDR_OVID_Pos         0            /**< \brief (PEVC_OVIDR) Overrun Interrupt Disable */
#define PEVC_OVIDR_OVID_Msk         (0xFFFFFFFFu << PEVC_OVIDR_OVID_Pos)
#define PEVC_OVIDR_OVID(value)      ((PEVC_OVIDR_OVID_Msk & ((value) << PEVC_OVIDR_OVID_Pos)))
#define   PEVC_OVIDR_OVID_0_Val           0x0u   /**< \brief (PEVC_OVIDR) No Action */
#define   PEVC_OVIDR_OVID_1_Val           0x1u   /**< \brief (PEVC_OVIDR) Enable Overrun Interrupt for Channel j */
#define PEVC_OVIDR_OVID_0           (PEVC_OVIDR_OVID_0_Val         << PEVC_OVIDR_OVID_Pos)
#define PEVC_OVIDR_OVID_1           (PEVC_OVIDR_OVID_1_Val         << PEVC_OVIDR_OVID_Pos)
#define PEVC_OVIDR_MASK             0xFFFFFFFFu  /**< \brief (PEVC_OVIDR) MASK Register */

/* -------- PEVC_OVIMR : (PEVC Offset: 0x048) (R/  32) Overrun Interrupt Mask Register -------- */
#define PEVC_OVIMR_OFFSET           0x048        /**< \brief (PEVC_OVIMR offset) Overrun Interrupt Mask Register */
#define PEVC_OVIMR_RESETVALUE       0x00000000   /**< \brief (PEVC_OVIMR reset_value) Overrun Interrupt Mask Register */

#define PEVC_OVIMR_OVIM_Pos         0            /**< \brief (PEVC_OVIMR) Overrun Interrupt Mask */
#define PEVC_OVIMR_OVIM_Msk         (0xFFFFFFFFu << PEVC_OVIMR_OVIM_Pos)
#define PEVC_OVIMR_OVIM(value)      ((PEVC_OVIMR_OVIM_Msk & ((value) << PEVC_OVIMR_OVIM_Pos)))
#define   PEVC_OVIMR_OVIM_0_Val           0x0u   /**< \brief (PEVC_OVIMR) Overrun Interrupt for Channel j Disabled */
#define   PEVC_OVIMR_OVIM_1_Val           0x1u   /**< \brief (PEVC_OVIMR) Overrun Interrupt for Channel j Enabled */
#define PEVC_OVIMR_OVIM_0           (PEVC_OVIMR_OVIM_0_Val         << PEVC_OVIMR_OVIM_Pos)
#define PEVC_OVIMR_OVIM_1           (PEVC_OVIMR_OVIM_1_Val         << PEVC_OVIMR_OVIM_Pos)
#define PEVC_OVIMR_MASK             0xFFFFFFFFu  /**< \brief (PEVC_OVIMR) MASK Register */

/* -------- PEVC_OVSR : (PEVC Offset: 0x050) (R/  32) Overrun Status Register -------- */
#define PEVC_OVSR_OFFSET            0x050        /**< \brief (PEVC_OVSR offset) Overrun Status Register */
#define PEVC_OVSR_RESETVALUE        0x00000000   /**< \brief (PEVC_OVSR reset_value) Overrun Status Register */

#define PEVC_OVSR_OVS_Pos           0            /**< \brief (PEVC_OVSR) Overrun Interrupt Status */
#define PEVC_OVSR_OVS_Msk           (0xFFFFFFFFu << PEVC_OVSR_OVS_Pos)
#define PEVC_OVSR_OVS(value)        ((PEVC_OVSR_OVS_Msk & ((value) << PEVC_OVSR_OVS_Pos)))
#define   PEVC_OVSR_OVS_0_Val             0x0u   /**< \brief (PEVC_OVSR) No Overrun occured on Channel j */
#define   PEVC_OVSR_OVS_1_Val             0x1u   /**< \brief (PEVC_OVSR) Overrun occured on Channel j */
#define PEVC_OVSR_OVS_0             (PEVC_OVSR_OVS_0_Val           << PEVC_OVSR_OVS_Pos)
#define PEVC_OVSR_OVS_1             (PEVC_OVSR_OVS_1_Val           << PEVC_OVSR_OVS_Pos)
#define PEVC_OVSR_MASK              0xFFFFFFFFu  /**< \brief (PEVC_OVSR) MASK Register */

/* -------- PEVC_OVSCR : (PEVC Offset: 0x054) ( /W 32) Overrun Status Clear Register -------- */
#define PEVC_OVSCR_OFFSET           0x054        /**< \brief (PEVC_OVSCR offset) Overrun Status Clear Register */
#define PEVC_OVSCR_RESETVALUE       0x00000000   /**< \brief (PEVC_OVSCR reset_value) Overrun Status Clear Register */

#define PEVC_OVSCR_OVSC_Pos         0            /**< \brief (PEVC_OVSCR) Overrun Interrupt Status Clear */
#define PEVC_OVSCR_OVSC_Msk         (0xFFFFFFFFu << PEVC_OVSCR_OVSC_Pos)
#define PEVC_OVSCR_OVSC(value)      ((PEVC_OVSCR_OVSC_Msk & ((value) << PEVC_OVSCR_OVSC_Pos)))
#define   PEVC_OVSCR_OVSC_0_Val           0x0u   /**< \brief (PEVC_OVSCR) No Action */
#define   PEVC_OVSCR_OVSC_1_Val           0x1u   /**< \brief (PEVC_OVSCR) Clear Overrun Status Bit j */
#define PEVC_OVSCR_OVSC_0           (PEVC_OVSCR_OVSC_0_Val         << PEVC_OVSCR_OVSC_Pos)
#define PEVC_OVSCR_OVSC_1           (PEVC_OVSCR_OVSC_1_Val         << PEVC_OVSCR_OVSC_Pos)
#define PEVC_OVSCR_MASK             0xFFFFFFFFu  /**< \brief (PEVC_OVSCR) MASK Register */

/* -------- PEVC_CHMX : (PEVC Offset: 0x100) (R/W 32) CHMX Channel Multiplexer -------- */
#define PEVC_CHMX_OFFSET            0x100        /**< \brief (PEVC_CHMX offset) Channel Multiplexer */
#define PEVC_CHMX_RESETVALUE        0x00000000   /**< \brief (PEVC_CHMX reset_value) Channel Multiplexer */

#define PEVC_CHMX_EVMX_Pos          0            /**< \brief (PEVC_CHMX) Event Multiplexer */
#define PEVC_CHMX_EVMX_Msk          (0x3Fu << PEVC_CHMX_EVMX_Pos)
#define PEVC_CHMX_EVMX(value)       ((PEVC_CHMX_EVMX_Msk & ((value) << PEVC_CHMX_EVMX_Pos)))
#define   PEVC_CHMX_EVMX_0_Val            0x0u   /**< \brief (PEVC_CHMX) Event 0 */
#define   PEVC_CHMX_EVMX_1_Val            0x1u   /**< \brief (PEVC_CHMX) Event 1 */
#define PEVC_CHMX_EVMX_0            (PEVC_CHMX_EVMX_0_Val          << PEVC_CHMX_EVMX_Pos)
#define PEVC_CHMX_EVMX_1            (PEVC_CHMX_EVMX_1_Val          << PEVC_CHMX_EVMX_Pos)
#define PEVC_CHMX_SMX_Pos           8            /**< \brief (PEVC_CHMX) Software Event Multiplexer */
#define PEVC_CHMX_SMX               (0x1u << PEVC_CHMX_SMX_Pos)
#define   PEVC_CHMX_SMX_0_Val             0x0u   /**< \brief (PEVC_CHMX) Hardware events */
#define   PEVC_CHMX_SMX_1_Val             0x1u   /**< \brief (PEVC_CHMX) Software event */
#define PEVC_CHMX_SMX_0             (PEVC_CHMX_SMX_0_Val           << PEVC_CHMX_SMX_Pos)
#define PEVC_CHMX_SMX_1             (PEVC_CHMX_SMX_1_Val           << PEVC_CHMX_SMX_Pos)
#define PEVC_CHMX_MASK              0x0000013Fu  /**< \brief (PEVC_CHMX) MASK Register */

/* -------- PEVC_EVS : (PEVC Offset: 0x200) (R/W 32) EVS Event Shaper -------- */
#define PEVC_EVS_OFFSET             0x200        /**< \brief (PEVC_EVS offset) Event Shaper */
#define PEVC_EVS_RESETVALUE         0x00000000   /**< \brief (PEVC_EVS reset_value) Event Shaper */

#define PEVC_EVS_EN_Pos             0            /**< \brief (PEVC_EVS) Event Shaper Enable */
#define PEVC_EVS_EN                 (0x1u << PEVC_EVS_EN_Pos)
#define   PEVC_EVS_EN_0_Val               0x0u   /**< \brief (PEVC_EVS) No Action */
#define   PEVC_EVS_EN_1_Val               0x1u   /**< \brief (PEVC_EVS) Event Shaper enable */
#define PEVC_EVS_EN_0               (PEVC_EVS_EN_0_Val             << PEVC_EVS_EN_Pos)
#define PEVC_EVS_EN_1               (PEVC_EVS_EN_1_Val             << PEVC_EVS_EN_Pos)
#define PEVC_EVS_IGFR_Pos           16           /**< \brief (PEVC_EVS) Input Glitch Filter Rise */
#define PEVC_EVS_IGFR               (0x1u << PEVC_EVS_IGFR_Pos)
#define   PEVC_EVS_IGFR_0_Val             0x0u   /**< \brief (PEVC_EVS) No Action */
#define   PEVC_EVS_IGFR_1_Val             0x1u   /**< \brief (PEVC_EVS) Input Glitch Filter : a rising edge on event input will raise trigger output */
#define PEVC_EVS_IGFR_0             (PEVC_EVS_IGFR_0_Val           << PEVC_EVS_IGFR_Pos)
#define PEVC_EVS_IGFR_1             (PEVC_EVS_IGFR_1_Val           << PEVC_EVS_IGFR_Pos)
#define PEVC_EVS_IGFF_Pos           17           /**< \brief (PEVC_EVS) Input Glitch Filter Fall */
#define PEVC_EVS_IGFF               (0x1u << PEVC_EVS_IGFF_Pos)
#define   PEVC_EVS_IGFF_0_Val             0x0u   /**< \brief (PEVC_EVS) No Action */
#define   PEVC_EVS_IGFF_1_Val             0x1u   /**< \brief (PEVC_EVS) Input Glitch Filter : a falling edge on event input will raise trigger output */
#define PEVC_EVS_IGFF_0             (PEVC_EVS_IGFF_0_Val           << PEVC_EVS_IGFF_Pos)
#define PEVC_EVS_IGFF_1             (PEVC_EVS_IGFF_1_Val           << PEVC_EVS_IGFF_Pos)
#define PEVC_EVS_IGFON_Pos          18           /**< \brief (PEVC_EVS) Input Glitch Filter Status */
#define PEVC_EVS_IGFON              (0x1u << PEVC_EVS_IGFON_Pos)
#define PEVC_EVS_MASK               0x00070001u  /**< \brief (PEVC_EVS) MASK Register */

/* -------- PEVC_IGFDR : (PEVC Offset: 0x300) (R/W 32) Input Glitch Filter Divider Register -------- */
#define PEVC_IGFDR_OFFSET           0x300        /**< \brief (PEVC_IGFDR offset) Input Glitch Filter Divider Register */
#define PEVC_IGFDR_RESETVALUE       0x00000000   /**< \brief (PEVC_IGFDR reset_value) Input Glitch Filter Divider Register */

#define PEVC_IGFDR_IGFDR_Pos        0            /**< \brief (PEVC_IGFDR) Input Glitch Filter Divider Register */
#define PEVC_IGFDR_IGFDR_Msk        (0xFu << PEVC_IGFDR_IGFDR_Pos)
#define PEVC_IGFDR_IGFDR(value)     ((PEVC_IGFDR_IGFDR_Msk & ((value) << PEVC_IGFDR_IGFDR_Pos)))
#define PEVC_IGFDR_MASK             0x0000000Fu  /**< \brief (PEVC_IGFDR) MASK Register */

/* -------- PEVC_PARAMETER : (PEVC Offset: 0x3F8) (R/  32) Parameter -------- */
#define PEVC_PARAMETER_OFFSET       0x3F8        /**< \brief (PEVC_PARAMETER offset) Parameter */
#define PEVC_PARAMETER_RESETVALUE   0x14061824   /**< \brief (PEVC_PARAMETER reset_value) Parameter */

